SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG24/Include/efr32bg24_agc.h
/**************************************************************************//**
 * @file
 * @brief EFR32BG24 AGC register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32BG24_AGC_H
#define EFR32BG24_AGC_H
#define AGC_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32BG24_AGC AGC
 * @{
 * @brief EFR32BG24 AGC Register Declaration.
 *****************************************************************************/

/** AGC Register Declaration. */
typedef struct {
  __IM uint32_t  IPVERSION;                     /**< IP Version                                         */
  __IOM uint32_t EN;                            /**< Enable peripheral clock to this module             */
  __IM uint32_t  STATUS0;                       /**< Status register 0                                  */
  __IM uint32_t  STATUS1;                       /**< Status register 1                                  */
  __IM uint32_t  STATUS2;                       /**< Status register 2                                  */
  uint32_t       RESERVED0[1U];                 /**< Reserved for future use                            */
  __IM uint32_t  RSSI;                          /**< Received Signal Strength Indicator                 */
  __IM uint32_t  FRAMERSSI;                     /**< FRAME RSSI value                                   */
  __IOM uint32_t CTRL0;                         /**< Control register 0                                 */
  __IOM uint32_t CTRL1;                         /**< Control register 1                                 */
  __IOM uint32_t CTRL2;                         /**< Control register 2                                 */
  __IOM uint32_t CTRL3;                         /**< Control register 3                                 */
  __IOM uint32_t CTRL4;                         /**< Control register 4                                 */
  __IOM uint32_t CTRL5;                         /**< Control register 5                                 */
  __IOM uint32_t CTRL6;                         /**< Control register 6                                 */
  __IOM uint32_t CTRL7;                         /**< Control register 1                                 */
  __IOM uint32_t RSSISTEPTHR;                   /**< RSSI step threshold                                */
  uint32_t       RESERVED1[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t IF;                            /**< Interrupt Flags Register                           */
  __IOM uint32_t IEN;                           /**< Interrupt Enable Register                          */
  uint32_t       RESERVED2[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t GAINRANGE;                     /**< Range of RX Gain to use in AGC                     */
  __IOM uint32_t AGCPERIOD0;                    /**< AGC period                                         */
  __IOM uint32_t AGCPERIOD1;                    /**< AGC Period                                         */
  __IOM uint32_t HICNTREGION0;                  /**< Hi-counter region-0                                */
  __IOM uint32_t HICNTREGION1;                  /**< Hi-counter region-1                                */
  __IOM uint32_t STEPDWN;                       /**< Hi-counter region-2                                */
  __IOM uint32_t GAINSTEPLIM0;                  /**< Limits for Gain Steps                              */
  __IOM uint32_t GAINSTEPLIM1;                  /**< Limits for Gain Steps                              */
  __IOM uint32_t PNRFATT0;                      /**< PN RF attenuation code group 0                     */
  __IOM uint32_t PNRFATT1;                      /**< PN RF attenuation code group 1                     */
  __IOM uint32_t PNRFATT2;                      /**< PN RF attenuation code group 2                     */
  __IOM uint32_t PNRFATT3;                      /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT4;                      /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT5;                      /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT6;                      /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT7;                      /**< PN RF attenuation code group 3                     */
  uint32_t       RESERVED3[4U];                 /**< Reserved for future use                            */
  __IOM uint32_t PNRFATTALT;                    /**< PN RF attenuation code group 3                     */
  __IOM uint32_t LNAMIXCODE0;                   /**< LNA/MIX slice code group 0                         */
  __IOM uint32_t LNAMIXCODE1;                   /**< LNA/MIX slice code group 1                         */
  __IOM uint32_t PGACODE0;                      /**< PGA gain code group 0                              */
  __IOM uint32_t PGACODE1;                      /**< PGA gain code group 1                              */
  __IOM uint32_t LBT;                           /**< Configure AGC for (ETSI) LBT                       */
  __IOM uint32_t MIRRORIF;                      /**< Mirror Interrupt Flags Register                    */
  __IOM uint32_t SEQIF;                         /**< SEQ Interrupt Flags Register                       */
  __IOM uint32_t SEQIEN;                        /**< SEQ Interrupt Enable Register                      */
  __IOM uint32_t RSSIABSTHR;                    /**< RSSI absolute threshold                            */
  __IOM uint32_t LNABOOST;                      /**< LNA boost control register                         */
  __IOM uint32_t ANTDIV;                        /**< Antenna diversity AGC setting                      */
  __IOM uint32_t DUALRFPKDTHD0;                 /**< Thresholds for dual rfpkd                          */
  __IOM uint32_t DUALRFPKDTHD1;                 /**< Thresholds for dual rfpkd                          */
  __IOM uint32_t SPARE;                         /**< Spare register for ECO                             */
  __IOM uint32_t PNRFFILT0;                     /**< PN RF attenuation code group 0                     */
  __IOM uint32_t PNRFFILT1;                     /**< PN RF attenuation code group 1                     */
  __IOM uint32_t PNRFFILT2;                     /**< PN RF attenuation code group 2                     */
  __IOM uint32_t PNRFFILT3;                     /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT4;                     /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT5;                     /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT6;                     /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT7;                     /**< PN RF attenuation code group 3                     */
  __IOM uint32_t FENOTCHATT0;                   /**< FE Notch attenuation code group 0                  */
  __IOM uint32_t FENOTCHATT1;                   /**< FE Notch attenuation code group 1                  */
  __IOM uint32_t FENOTCHATT2;                   /**< FE Notch attenuation code group 2                  */
  __IOM uint32_t FENOTCHATT3;                   /**< FE Notch attenuation code group 3                  */
  __IOM uint32_t FENOTCHATT4;                   /**< FE Notch attenuation code group 4                  */
  __IOM uint32_t FENOTCHATT5;                   /**< FE Notch attenuation code group 5                  */
  __IOM uint32_t FENOTCHATT6;                   /**< FE Notch attenuation code group 6                  */
  __IOM uint32_t FENOTCHATT7;                   /**< FE Notch attenuation code group 7                  */
  __IOM uint32_t FENOTCHATT8;                   /**< FE Notch attenuation code group 8                  */
  __IOM uint32_t FENOTCHATT9;                   /**< FE Notch attenuation code group 9                  */
  __IOM uint32_t FENOTCHATT10;                  /**< FE Notch attenuation code group 10                 */
  __IOM uint32_t FENOTCHATT11;                  /**< FE Notch attenuation code group 11                 */
  __IOM uint32_t FENOTCHFILT0;                  /**< FE Notch filter code group 0                       */
  __IOM uint32_t FENOTCHFILT1;                  /**< FE Notch filter code group 1                       */
  __IOM uint32_t FENOTCHFILT2;                  /**< FE Notch filter code group 2                       */
  __IOM uint32_t FENOTCHFILT3;                  /**< FE Notch filter code group 3                       */
  __IOM uint32_t FENOTCHFILT4;                  /**< FE Notch filter code group 4                       */
  __IOM uint32_t FENOTCHFILT5;                  /**< FE Notch filter code group 5                       */
  __IOM uint32_t FENOTCHFILT6;                  /**< FE Notch filter code group 6                       */
  __IOM uint32_t FENOTCHFILT7;                  /**< FE Notch filter code group 7                       */
  __IOM uint32_t FENOTCHFILT8;                  /**< FE Notch filter code group 8                       */
  __IOM uint32_t FENOTCHFILT9;                  /**< FE Notch filter code group 9                       */
  __IOM uint32_t FENOTCHFILT10;                 /**< FE Notch filter code group 10                      */
  __IOM uint32_t FENOTCHFILT11;                 /**< FE Notch filter code group 11                      */
  __IM uint32_t  CCADEBUG;                      /**< CCA debug register                                 */
  uint32_t       RESERVED4[935U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_SET;                 /**< IP Version                                         */
  __IOM uint32_t EN_SET;                        /**< Enable peripheral clock to this module             */
  __IM uint32_t  STATUS0_SET;                   /**< Status register 0                                  */
  __IM uint32_t  STATUS1_SET;                   /**< Status register 1                                  */
  __IM uint32_t  STATUS2_SET;                   /**< Status register 2                                  */
  uint32_t       RESERVED5[1U];                 /**< Reserved for future use                            */
  __IM uint32_t  RSSI_SET;                      /**< Received Signal Strength Indicator                 */
  __IM uint32_t  FRAMERSSI_SET;                 /**< FRAME RSSI value                                   */
  __IOM uint32_t CTRL0_SET;                     /**< Control register 0                                 */
  __IOM uint32_t CTRL1_SET;                     /**< Control register 1                                 */
  __IOM uint32_t CTRL2_SET;                     /**< Control register 2                                 */
  __IOM uint32_t CTRL3_SET;                     /**< Control register 3                                 */
  __IOM uint32_t CTRL4_SET;                     /**< Control register 4                                 */
  __IOM uint32_t CTRL5_SET;                     /**< Control register 5                                 */
  __IOM uint32_t CTRL6_SET;                     /**< Control register 6                                 */
  __IOM uint32_t CTRL7_SET;                     /**< Control register 1                                 */
  __IOM uint32_t RSSISTEPTHR_SET;               /**< RSSI step threshold                                */
  uint32_t       RESERVED6[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t IF_SET;                        /**< Interrupt Flags Register                           */
  __IOM uint32_t IEN_SET;                       /**< Interrupt Enable Register                          */
  uint32_t       RESERVED7[1U];                 /**< Reserved for future use                            */
  __IOM uint32_t GAINRANGE_SET;                 /**< Range of RX Gain to use in AGC                     */
  __IOM uint32_t AGCPERIOD0_SET;                /**< AGC period                                         */
  __IOM uint32_t AGCPERIOD1_SET;                /**< AGC Period                                         */
  __IOM uint32_t HICNTREGION0_SET;              /**< Hi-counter region-0                                */
  __IOM uint32_t HICNTREGION1_SET;              /**< Hi-counter region-1                                */
  __IOM uint32_t STEPDWN_SET;                   /**< Hi-counter region-2                                */
  __IOM uint32_t GAINSTEPLIM0_SET;              /**< Limits for Gain Steps                              */
  __IOM uint32_t GAINSTEPLIM1_SET;              /**< Limits for Gain Steps                              */
  __IOM uint32_t PNRFATT0_SET;                  /**< PN RF attenuation code group 0                     */
  __IOM uint32_t PNRFATT1_SET;                  /**< PN RF attenuation code group 1                     */
  __IOM uint32_t PNRFATT2_SET;                  /**< PN RF attenuation code group 2                     */
  __IOM uint32_t PNRFATT3_SET;                  /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT4_SET;                  /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT5_SET;                  /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT6_SET;                  /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFATT7_SET;                  /**< PN RF attenuation code group 3                     */
  uint32_t       RESERVED8[4U];                 /**< Reserved for future use                            */
  __IOM uint32_t PNRFATTALT_SET;                /**< PN RF attenuation code group 3                     */
  __IOM uint32_t LNAMIXCODE0_SET;               /**< LNA/MIX slice code group 0                         */
  __IOM uint32_t LNAMIXCODE1_SET;               /**< LNA/MIX slice code group 1                         */
  __IOM uint32_t PGACODE0_SET;                  /**< PGA gain code group 0                              */
  __IOM uint32_t PGACODE1_SET;                  /**< PGA gain code group 1                              */
  __IOM uint32_t LBT_SET;                       /**< Configure AGC for (ETSI) LBT                       */
  __IOM uint32_t MIRRORIF_SET;                  /**< Mirror Interrupt Flags Register                    */
  __IOM uint32_t SEQIF_SET;                     /**< SEQ Interrupt Flags Register                       */
  __IOM uint32_t SEQIEN_SET;                    /**< SEQ Interrupt Enable Register                      */
  __IOM uint32_t RSSIABSTHR_SET;                /**< RSSI absolute threshold                            */
  __IOM uint32_t LNABOOST_SET;                  /**< LNA boost control register                         */
  __IOM uint32_t ANTDIV_SET;                    /**< Antenna diversity AGC setting                      */
  __IOM uint32_t DUALRFPKDTHD0_SET;             /**< Thresholds for dual rfpkd                          */
  __IOM uint32_t DUALRFPKDTHD1_SET;             /**< Thresholds for dual rfpkd                          */
  __IOM uint32_t SPARE_SET;                     /**< Spare register for ECO                             */
  __IOM uint32_t PNRFFILT0_SET;                 /**< PN RF attenuation code group 0                     */
  __IOM uint32_t PNRFFILT1_SET;                 /**< PN RF attenuation code group 1                     */
  __IOM uint32_t PNRFFILT2_SET;                 /**< PN RF attenuation code group 2                     */
  __IOM uint32_t PNRFFILT3_SET;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT4_SET;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT5_SET;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT6_SET;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t PNRFFILT7_SET;                 /**< PN RF attenuation code group 3                     */
  __IOM uint32_t FENOTCHATT0_SET;               /**< FE Notch attenuation code group 0                  */
  __IOM uint32_t FENOTCHATT1_SET;               /**< FE Notch attenuation code group 1                  */
  __IOM uint32_t FENOTCHATT2_SET;               /**< FE Notch attenuation code group 2                  */
  __IOM uint32_t FENOTCHATT3_SET;               /**< FE Notch attenuation code group 3                  */
  __IOM uint32_t FENOTCHATT4_SET;               /**< FE Notch attenuation code group 4                  */
  __IOM uint32_t FENOTCHATT5_SET;               /**< FE Notch attenuation code group 5                  */
  __IOM uint32_t FENOTCHATT6_SET;               /**< FE Notch attenuation code group 6                  */
  __IOM uint32_t FENOTCHATT7_SET;               /**< FE Notch attenuation code group 7                  */
  __IOM uint32_t FENOTCHATT8_SET;               /**< FE Notch attenuation code group 8                  */
  __IOM uint32_t FENOTCHATT9_SET;               /**< FE Notch attenuation code group 9                  */
  __IOM uint32_t FENOTCHATT10_SET;              /**< FE Notch attenuation code group 10                 */
  __IOM uint32_t FENOTCHATT11_SET;              /**< FE Notch attenuation code group 11                 */
  __IOM uint32_t FENOTCHFILT0_SET;              /**< FE Notch filter code group 0                       */
  __IOM uint32_t FENOTCHFILT1_SET;              /**< FE Notch filter code group 1                       */
  __IOM uint32_t FENOTCHFILT2_SET;              /**< FE Notch filter code group 2                       */
  __IOM uint32_t FENOTCHFILT3_SET;              /**< FE Notch filter code group 3                       */
  __IOM uint32_t FENOTCHFILT4_SET;              /**< FE Notch filter code group 4                       */
  __IOM uint32_t FENOTCHFILT5_SET;              /**< FE Notch filter code group 5                       */
  __IOM uint32_t FENOTCHFILT6_SET;              /**< FE Notch filter code group 6                       */
  __IOM uint32_t FENOTCHFILT7_SET;              /**< FE Notch filter code group 7                       */
  __IOM uint32_t FENOTCHFILT8_SET;              /**< FE Notch filter code group 8                       */
  __IOM uint32_t FENOTCHFILT9_SET;              /**< FE Notch filter code group 9                       */
  __IOM uint32_t FENOTCHFILT10_SET;             /**< FE Notch filter code group 10                      */
  __IOM uint32_t FENOTCHFILT11_SET;             /**< FE Notch filter code group 11                      */
  __IM uint32_t  CCADEBUG_SET;                  /**< CCA debug register                                 */
  uint32_t       RESERVED9[935U];               /**< Reserved for future use                            */
  __IM uint32_t  IPVERSION_CLR;                 /**< IP Version                                         */
  __IOM uint32_t EN_CLR;                        /**< Enable peripheral clock to this module             */
  __IM uint32_t  STATUS0_CLR;                   /**< Status register 0                                  */
  __IM uint32_t  STATUS1_CLR;                   /**< Status register 1                                  */
  __IM uint32_t  STATUS2_CLR;                   /**< Status register 2                                  */
  uint32_t       RESERVED10[1U];                /**< Reserved for future use                            */
  __IM uint32_t  RSSI_CLR;                      /**< Received Signal Strength Indicator                 */
  __IM uint32_t  FRAMERSSI_CLR;                 /**< FRAME RSSI value                                   */
  __IOM uint32_t CTRL0_CLR;                     /**< Control register 0                                 */
  __IOM uint32_t CTRL1_CLR;                     /**< Control register 1                                 */
  __IOM uint32_t CTRL2_CLR;                     /**< Control register 2                                 */
  __IOM uint32_t CTRL3_CLR;                     /**< Control register 3                                 */
  __IOM uint32_t CTRL4_CLR;                     /**< Control register 4                                 */
  __IOM uint32_t CTRL5_CLR;                     /**< Control register 5                                 */
  __IOM uint32_t CTRL6_CLR;                     /**< Control register 6                                 */
  __IOM uint32_t CTRL7_CLR;                     /**< Control register 1                                 */
  __IOM uint32_t RSSISTEPTHR_CLR;               /**< RSSI step threshold                                */
  uint32_t       RESERVED11[1U];                /**< Reserved for future use                            */
  __IOM uint32_t IF_CLR;                        /**< Interrupt Flags Register                           */
  __IOM uint32_t IEN_CLR;                       /**< Interrupt Enable Register                          */
  uint32_t       RESERVED12[1U];                /**< Reserved for future use                            */
  __IOM uint32_t GAINRANGE_CLR;                 /**< Range of RX Gain to use in AGC                     */
  __IOM uint32_t AGCPERIOD0_CLR;                /**< AGC period                                         */
  __IOM uint32_t AGCPERIOD1_CLR;                /**< AGC Period                                         */
  __IOM uint32_t HICNTREGION0_CLR;              /**< Hi-counter region-0                                */
  __IOM uint32_t HICNTREGION1_CLR;              /**< Hi-counter region-1                                */
  __IOM uint32_t STEPDWN_CLR;                   /**< Hi-counter region-2                                */
  __IOM uint32_t GAINSTEPLIM0_CLR;              /**< Limits for Gain Steps                              */
  __IOM uint32_t GAINSTEPLIM1_CLR;              /**< Limits for Gain Steps                              */
  __IOM uint32_t PNRFATT0_CLR;                  /**< PN RF attenuation code group 0                     */
  __IOM uint32_t PNRFATT1_CLR;                  /**< PN RF attenuation code group 1                     */
