SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG24/Include/efr32bg24_agc.h
/* Bit fields for AGC PNRFFILT1 */
#define _AGC_PNRFFILT1_RESETVALUE                      0x00801804UL                                /**< Default value for AGC_PNRFFILT1             */
#define _AGC_PNRFFILT1_MASK                            0x3FFFFFFFUL                                /**< Mask for AGC_PNRFFILT1                      */
#define _AGC_PNRFFILT1_LNAMIXRFATT4_SHIFT              0                                           /**< Shift value for AGC_LNAMIXRFATT4            */
#define _AGC_PNRFFILT1_LNAMIXRFATT4_MASK               0x3FFUL                                     /**< Bit mask for AGC_LNAMIXRFATT4               */
#define _AGC_PNRFFILT1_LNAMIXRFATT4_DEFAULT            0x00000004UL                                /**< Mode DEFAULT for AGC_PNRFFILT1              */
#define AGC_PNRFFILT1_LNAMIXRFATT4_DEFAULT             (_AGC_PNRFFILT1_LNAMIXRFATT4_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFFILT1      */
#define _AGC_PNRFFILT1_LNAMIXRFATT5_SHIFT              10                                          /**< Shift value for AGC_LNAMIXRFATT5            */
#define _AGC_PNRFFILT1_LNAMIXRFATT5_MASK               0xFFC00UL                                   /**< Bit mask for AGC_LNAMIXRFATT5               */
#define _AGC_PNRFFILT1_LNAMIXRFATT5_DEFAULT            0x00000006UL                                /**< Mode DEFAULT for AGC_PNRFFILT1              */
#define AGC_PNRFFILT1_LNAMIXRFATT5_DEFAULT             (_AGC_PNRFFILT1_LNAMIXRFATT5_DEFAULT << 10) /**< Shifted mode DEFAULT for AGC_PNRFFILT1      */
#define _AGC_PNRFFILT1_LNAMIXRFATT6_SHIFT              20                                          /**< Shift value for AGC_LNAMIXRFATT6            */
#define _AGC_PNRFFILT1_LNAMIXRFATT6_MASK               0x3FF00000UL                                /**< Bit mask for AGC_LNAMIXRFATT6               */
#define _AGC_PNRFFILT1_LNAMIXRFATT6_DEFAULT            0x00000008UL                                /**< Mode DEFAULT for AGC_PNRFFILT1              */
#define AGC_PNRFFILT1_LNAMIXRFATT6_DEFAULT             (_AGC_PNRFFILT1_LNAMIXRFATT6_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_PNRFFILT1      */

/* Bit fields for AGC PNRFFILT2 */
#define _AGC_PNRFFILT2_RESETVALUE                      0x01203C0BUL                                /**< Default value for AGC_PNRFFILT2             */
#define _AGC_PNRFFILT2_MASK                            0x3FFFFFFFUL                                /**< Mask for AGC_PNRFFILT2                      */
#define _AGC_PNRFFILT2_LNAMIXRFATT7_SHIFT              0                                           /**< Shift value for AGC_LNAMIXRFATT7            */
#define _AGC_PNRFFILT2_LNAMIXRFATT7_MASK               0x3FFUL                                     /**< Bit mask for AGC_LNAMIXRFATT7               */
#define _AGC_PNRFFILT2_LNAMIXRFATT7_DEFAULT            0x0000000BUL                                /**< Mode DEFAULT for AGC_PNRFFILT2              */
#define AGC_PNRFFILT2_LNAMIXRFATT7_DEFAULT             (_AGC_PNRFFILT2_LNAMIXRFATT7_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFFILT2      */
#define _AGC_PNRFFILT2_LNAMIXRFATT8_SHIFT              10                                          /**< Shift value for AGC_LNAMIXRFATT8            */
#define _AGC_PNRFFILT2_LNAMIXRFATT8_MASK               0xFFC00UL                                   /**< Bit mask for AGC_LNAMIXRFATT8               */
#define _AGC_PNRFFILT2_LNAMIXRFATT8_DEFAULT            0x0000000FUL                                /**< Mode DEFAULT for AGC_PNRFFILT2              */
#define AGC_PNRFFILT2_LNAMIXRFATT8_DEFAULT             (_AGC_PNRFFILT2_LNAMIXRFATT8_DEFAULT << 10) /**< Shifted mode DEFAULT for AGC_PNRFFILT2      */
#define _AGC_PNRFFILT2_LNAMIXRFATT9_SHIFT              20                                          /**< Shift value for AGC_LNAMIXRFATT9            */
#define _AGC_PNRFFILT2_LNAMIXRFATT9_MASK               0x3FF00000UL                                /**< Bit mask for AGC_LNAMIXRFATT9               */
#define _AGC_PNRFFILT2_LNAMIXRFATT9_DEFAULT            0x00000012UL                                /**< Mode DEFAULT for AGC_PNRFFILT2              */
#define AGC_PNRFFILT2_LNAMIXRFATT9_DEFAULT             (_AGC_PNRFFILT2_LNAMIXRFATT9_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_PNRFFILT2      */

/* Bit fields for AGC PNRFFILT3 */
#define _AGC_PNRFFILT3_RESETVALUE                      0x02107C18UL                                 /**< Default value for AGC_PNRFFILT3             */
#define _AGC_PNRFFILT3_MASK                            0x3FFFFFFFUL                                 /**< Mask for AGC_PNRFFILT3                      */
#define _AGC_PNRFFILT3_LNAMIXRFATT10_SHIFT             0                                            /**< Shift value for AGC_LNAMIXRFATT10           */
#define _AGC_PNRFFILT3_LNAMIXRFATT10_MASK              0x3FFUL                                      /**< Bit mask for AGC_LNAMIXRFATT10              */
#define _AGC_PNRFFILT3_LNAMIXRFATT10_DEFAULT           0x00000018UL                                 /**< Mode DEFAULT for AGC_PNRFFILT3              */
#define AGC_PNRFFILT3_LNAMIXRFATT10_DEFAULT            (_AGC_PNRFFILT3_LNAMIXRFATT10_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_PNRFFILT3      */
#define _AGC_PNRFFILT3_LNAMIXRFATT11_SHIFT             10                                           /**< Shift value for AGC_LNAMIXRFATT11           */
#define _AGC_PNRFFILT3_LNAMIXRFATT11_MASK              0xFFC00UL                                    /**< Bit mask for AGC_LNAMIXRFATT11              */
#define _AGC_PNRFFILT3_LNAMIXRFATT11_DEFAULT           0x0000001FUL                                 /**< Mode DEFAULT for AGC_PNRFFILT3              */
#define AGC_PNRFFILT3_LNAMIXRFATT11_DEFAULT            (_AGC_PNRFFILT3_LNAMIXRFATT11_DEFAULT << 10) /**< Shifted mode DEFAULT for AGC_PNRFFILT3      */
#define _AGC_PNRFFILT3_LNAMIXRFATT12_SHIFT             20                                           /**< Shift value for AGC_LNAMIXRFATT12           */
#define _AGC_PNRFFILT3_LNAMIXRFATT12_MASK              0x3FF00000UL                                 /**< Bit mask for AGC_LNAMIXRFATT12              */
#define _AGC_PNRFFILT3_LNAMIXRFATT12_DEFAULT           0x00000021UL                                 /**< Mode DEFAULT for AGC_PNRFFILT3              */
#define AGC_PNRFFILT3_LNAMIXRFATT12_DEFAULT            (_AGC_PNRFFILT3_LNAMIXRFATT12_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_PNRFFILT3      */

