SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG24/Include/efr32bg24_agc.h
/* Bit fields for AGC FENOTCHFILT2 */
#define _AGC_FENOTCHFILT2_RESETVALUE                   0x00000000UL                                      /**< Default value for AGC_FENOTCHFILT2          */
#define _AGC_FENOTCHFILT2_MASK                         0x3FFF3FFFUL                                      /**< Mask for AGC_FENOTCHFILT2                   */
#define _AGC_FENOTCHFILT2_FENOTCHATTNSEL5_SHIFT        0                                                 /**< Shift value for AGC_FENOTCHATTNSEL5         */
#define _AGC_FENOTCHFILT2_FENOTCHATTNSEL5_MASK         0xFUL                                             /**< Bit mask for AGC_FENOTCHATTNSEL5            */
#define _AGC_FENOTCHFILT2_FENOTCHATTNSEL5_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT2           */
#define AGC_FENOTCHFILT2_FENOTCHATTNSEL5_DEFAULT       (_AGC_FENOTCHFILT2_FENOTCHATTNSEL5_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT2   */
#define _AGC_FENOTCHFILT2_FENOTCHCAPCRSE5_SHIFT        4                                                 /**< Shift value for AGC_FENOTCHCAPCRSE5         */
#define _AGC_FENOTCHFILT2_FENOTCHCAPCRSE5_MASK         0xF0UL                                            /**< Bit mask for AGC_FENOTCHCAPCRSE5            */
#define _AGC_FENOTCHFILT2_FENOTCHCAPCRSE5_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT2           */
#define AGC_FENOTCHFILT2_FENOTCHCAPCRSE5_DEFAULT       (_AGC_FENOTCHFILT2_FENOTCHCAPCRSE5_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT2   */
#define _AGC_FENOTCHFILT2_FENOTCHCAPFINE5_SHIFT        8                                                 /**< Shift value for AGC_FENOTCHCAPFINE5         */
#define _AGC_FENOTCHFILT2_FENOTCHCAPFINE5_MASK         0xF00UL                                           /**< Bit mask for AGC_FENOTCHCAPFINE5            */
#define _AGC_FENOTCHFILT2_FENOTCHCAPFINE5_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT2           */
#define AGC_FENOTCHFILT2_FENOTCHCAPFINE5_DEFAULT       (_AGC_FENOTCHFILT2_FENOTCHCAPFINE5_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT2   */
#define AGC_FENOTCHFILT2_FENOTCHRATTNEN5               (0x1UL << 12)                                     /**< FE notch rattn enable for index 5           */
#define _AGC_FENOTCHFILT2_FENOTCHRATTNEN5_SHIFT        12                                                /**< Shift value for AGC_FENOTCHRATTNEN5         */
#define _AGC_FENOTCHFILT2_FENOTCHRATTNEN5_MASK         0x1000UL                                          /**< Bit mask for AGC_FENOTCHRATTNEN5            */
#define _AGC_FENOTCHFILT2_FENOTCHRATTNEN5_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT2           */
#define AGC_FENOTCHFILT2_FENOTCHRATTNEN5_DEFAULT       (_AGC_FENOTCHFILT2_FENOTCHRATTNEN5_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT2   */
#define AGC_FENOTCHFILT2_FENOTCHEN5                    (0x1UL << 13)                                     /**< FE notch enable for index 5                 */
#define _AGC_FENOTCHFILT2_FENOTCHEN5_SHIFT             13                                                /**< Shift value for AGC_FENOTCHEN5              */
#define _AGC_FENOTCHFILT2_FENOTCHEN5_MASK              0x2000UL                                          /**< Bit mask for AGC_FENOTCHEN5                 */
#define _AGC_FENOTCHFILT2_FENOTCHEN5_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT2           */
#define AGC_FENOTCHFILT2_FENOTCHEN5_DEFAULT            (_AGC_FENOTCHFILT2_FENOTCHEN5_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT2   */
#define _AGC_FENOTCHFILT2_FENOTCHATTNSEL6_SHIFT        16                                                /**< Shift value for AGC_FENOTCHATTNSEL6         */
#define _AGC_FENOTCHFILT2_FENOTCHATTNSEL6_MASK         0xF0000UL                                         /**< Bit mask for AGC_FENOTCHATTNSEL6            */
#define _AGC_FENOTCHFILT2_FENOTCHATTNSEL6_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT2           */
#define AGC_FENOTCHFILT2_FENOTCHATTNSEL6_DEFAULT       (_AGC_FENOTCHFILT2_FENOTCHATTNSEL6_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT2   */
#define _AGC_FENOTCHFILT2_FENOTCHCAPCRSE6_SHIFT        20                                                /**< Shift value for AGC_FENOTCHCAPCRSE6         */
#define _AGC_FENOTCHFILT2_FENOTCHCAPCRSE6_MASK         0xF00000UL                                        /**< Bit mask for AGC_FENOTCHCAPCRSE6            */
#define _AGC_FENOTCHFILT2_FENOTCHCAPCRSE6_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT2           */
#define AGC_FENOTCHFILT2_FENOTCHCAPCRSE6_DEFAULT       (_AGC_FENOTCHFILT2_FENOTCHCAPCRSE6_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT2   */
#define _AGC_FENOTCHFILT2_FENOTCHCAPFINE6_SHIFT        24                                                /**< Shift value for AGC_FENOTCHCAPFINE6         */
#define _AGC_FENOTCHFILT2_FENOTCHCAPFINE6_MASK         0xF000000UL                                       /**< Bit mask for AGC_FENOTCHCAPFINE6            */
#define _AGC_FENOTCHFILT2_FENOTCHCAPFINE6_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT2           */
#define AGC_FENOTCHFILT2_FENOTCHCAPFINE6_DEFAULT       (_AGC_FENOTCHFILT2_FENOTCHCAPFINE6_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT2   */
#define AGC_FENOTCHFILT2_FENOTCHRATTNEN6               (0x1UL << 28)                                     /**< FE notch rattn enable for index 6           */
#define _AGC_FENOTCHFILT2_FENOTCHRATTNEN6_SHIFT        28                                                /**< Shift value for AGC_FENOTCHRATTNEN6         */
#define _AGC_FENOTCHFILT2_FENOTCHRATTNEN6_MASK         0x10000000UL                                      /**< Bit mask for AGC_FENOTCHRATTNEN6            */
#define _AGC_FENOTCHFILT2_FENOTCHRATTNEN6_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT2           */
#define AGC_FENOTCHFILT2_FENOTCHRATTNEN6_DEFAULT       (_AGC_FENOTCHFILT2_FENOTCHRATTNEN6_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT2   */
#define AGC_FENOTCHFILT2_FENOTCHEN6                    (0x1UL << 29)                                     /**< FE notch enable for index 6                 */
#define _AGC_FENOTCHFILT2_FENOTCHEN6_SHIFT             29                                                /**< Shift value for AGC_FENOTCHEN6              */
#define _AGC_FENOTCHFILT2_FENOTCHEN6_MASK              0x20000000UL                                      /**< Bit mask for AGC_FENOTCHEN6                 */
#define _AGC_FENOTCHFILT2_FENOTCHEN6_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT2           */
#define AGC_FENOTCHFILT2_FENOTCHEN6_DEFAULT            (_AGC_FENOTCHFILT2_FENOTCHEN6_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT2   */

/* Bit fields for AGC FENOTCHFILT3 */
#define _AGC_FENOTCHFILT3_RESETVALUE                   0x00000000UL                                      /**< Default value for AGC_FENOTCHFILT3          */
#define _AGC_FENOTCHFILT3_MASK                         0x3FFF3FFFUL                                      /**< Mask for AGC_FENOTCHFILT3                   */
#define _AGC_FENOTCHFILT3_FENOTCHATTNSEL7_SHIFT        0                                                 /**< Shift value for AGC_FENOTCHATTNSEL7         */
#define _AGC_FENOTCHFILT3_FENOTCHATTNSEL7_MASK         0xFUL                                             /**< Bit mask for AGC_FENOTCHATTNSEL7            */
#define _AGC_FENOTCHFILT3_FENOTCHATTNSEL7_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT3           */
#define AGC_FENOTCHFILT3_FENOTCHATTNSEL7_DEFAULT       (_AGC_FENOTCHFILT3_FENOTCHATTNSEL7_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT3   */
#define _AGC_FENOTCHFILT3_FENOTCHCAPCRSE7_SHIFT        4                                                 /**< Shift value for AGC_FENOTCHCAPCRSE7         */
#define _AGC_FENOTCHFILT3_FENOTCHCAPCRSE7_MASK         0xF0UL                                            /**< Bit mask for AGC_FENOTCHCAPCRSE7            */
#define _AGC_FENOTCHFILT3_FENOTCHCAPCRSE7_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT3           */
#define AGC_FENOTCHFILT3_FENOTCHCAPCRSE7_DEFAULT       (_AGC_FENOTCHFILT3_FENOTCHCAPCRSE7_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT3   */
#define _AGC_FENOTCHFILT3_FENOTCHCAPFINE7_SHIFT        8                                                 /**< Shift value for AGC_FENOTCHCAPFINE7         */
#define _AGC_FENOTCHFILT3_FENOTCHCAPFINE7_MASK         0xF00UL                                           /**< Bit mask for AGC_FENOTCHCAPFINE7            */
#define _AGC_FENOTCHFILT3_FENOTCHCAPFINE7_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT3           */
#define AGC_FENOTCHFILT3_FENOTCHCAPFINE7_DEFAULT       (_AGC_FENOTCHFILT3_FENOTCHCAPFINE7_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT3   */
#define AGC_FENOTCHFILT3_FENOTCHRATTNEN7               (0x1UL << 12)                                     /**< FE notch rattn enable for index 7           */
#define _AGC_FENOTCHFILT3_FENOTCHRATTNEN7_SHIFT        12                                                /**< Shift value for AGC_FENOTCHRATTNEN7         */
#define _AGC_FENOTCHFILT3_FENOTCHRATTNEN7_MASK         0x1000UL                                          /**< Bit mask for AGC_FENOTCHRATTNEN7            */
#define _AGC_FENOTCHFILT3_FENOTCHRATTNEN7_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT3           */
#define AGC_FENOTCHFILT3_FENOTCHRATTNEN7_DEFAULT       (_AGC_FENOTCHFILT3_FENOTCHRATTNEN7_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT3   */
#define AGC_FENOTCHFILT3_FENOTCHEN7                    (0x1UL << 13)                                     /**< FE notch enable for index 7                 */
#define _AGC_FENOTCHFILT3_FENOTCHEN7_SHIFT             13                                                /**< Shift value for AGC_FENOTCHEN7              */
#define _AGC_FENOTCHFILT3_FENOTCHEN7_MASK              0x2000UL                                          /**< Bit mask for AGC_FENOTCHEN7                 */
#define _AGC_FENOTCHFILT3_FENOTCHEN7_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT3           */
#define AGC_FENOTCHFILT3_FENOTCHEN7_DEFAULT            (_AGC_FENOTCHFILT3_FENOTCHEN7_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT3   */
#define _AGC_FENOTCHFILT3_FENOTCHATTNSEL8_SHIFT        16                                                /**< Shift value for AGC_FENOTCHATTNSEL8         */
#define _AGC_FENOTCHFILT3_FENOTCHATTNSEL8_MASK         0xF0000UL                                         /**< Bit mask for AGC_FENOTCHATTNSEL8            */
#define _AGC_FENOTCHFILT3_FENOTCHATTNSEL8_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT3           */
#define AGC_FENOTCHFILT3_FENOTCHATTNSEL8_DEFAULT       (_AGC_FENOTCHFILT3_FENOTCHATTNSEL8_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT3   */
#define _AGC_FENOTCHFILT3_FENOTCHCAPCRSE8_SHIFT        20                                                /**< Shift value for AGC_FENOTCHCAPCRSE8         */
#define _AGC_FENOTCHFILT3_FENOTCHCAPCRSE8_MASK         0xF00000UL                                        /**< Bit mask for AGC_FENOTCHCAPCRSE8            */
#define _AGC_FENOTCHFILT3_FENOTCHCAPCRSE8_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT3           */
#define AGC_FENOTCHFILT3_FENOTCHCAPCRSE8_DEFAULT       (_AGC_FENOTCHFILT3_FENOTCHCAPCRSE8_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT3   */
#define _AGC_FENOTCHFILT3_FENOTCHCAPFINE8_SHIFT        24                                                /**< Shift value for AGC_FENOTCHCAPFINE8         */
#define _AGC_FENOTCHFILT3_FENOTCHCAPFINE8_MASK         0xF000000UL                                       /**< Bit mask for AGC_FENOTCHCAPFINE8            */
#define _AGC_FENOTCHFILT3_FENOTCHCAPFINE8_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT3           */
#define AGC_FENOTCHFILT3_FENOTCHCAPFINE8_DEFAULT       (_AGC_FENOTCHFILT3_FENOTCHCAPFINE8_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT3   */
#define AGC_FENOTCHFILT3_FENOTCHRATTNEN8               (0x1UL << 28)                                     /**< FE notch rattn enable for index 8           */
#define _AGC_FENOTCHFILT3_FENOTCHRATTNEN8_SHIFT        28                                                /**< Shift value for AGC_FENOTCHRATTNEN8         */
#define _AGC_FENOTCHFILT3_FENOTCHRATTNEN8_MASK         0x10000000UL                                      /**< Bit mask for AGC_FENOTCHRATTNEN8            */
#define _AGC_FENOTCHFILT3_FENOTCHRATTNEN8_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT3           */
#define AGC_FENOTCHFILT3_FENOTCHRATTNEN8_DEFAULT       (_AGC_FENOTCHFILT3_FENOTCHRATTNEN8_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT3   */
#define AGC_FENOTCHFILT3_FENOTCHEN8                    (0x1UL << 29)                                     /**< FE notch enable for index 8                 */
#define _AGC_FENOTCHFILT3_FENOTCHEN8_SHIFT             29                                                /**< Shift value for AGC_FENOTCHEN8              */
#define _AGC_FENOTCHFILT3_FENOTCHEN8_MASK              0x20000000UL                                      /**< Bit mask for AGC_FENOTCHEN8                 */
#define _AGC_FENOTCHFILT3_FENOTCHEN8_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHFILT3           */
#define AGC_FENOTCHFILT3_FENOTCHEN8_DEFAULT            (_AGC_FENOTCHFILT3_FENOTCHEN8_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT3   */

